
///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,ОписаниеШага,ТипШага,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЕстьСотрудникСДатойРождения111985()","ЕстьСотрудникСДатойРождения111985","Допустим есть сотрудник с датой рождения 1.1.1985","","");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЕстьТекущаяДата(Парам01)","ЕстьТекущаяДата","И есть текущая дата 31.12.2017","","");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЕгоВозрастВМесяцахБудетРавен(Парам01)","ЕгоВозрастВМесяцахБудетРавен","Тогда Его возраст в месяцах будет равен 276","","");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Допустим есть сотрудник с датой рождения 1.1.1985
//@ЕстьСотрудникСДатойРождения111985()
Процедура ЕстьСотрудникСДатойРождения111985() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	Контекст.Вставить("ДатаРождения",'19850101');
КонецПроцедуры

&НаКлиенте
//И есть текущая дата 31.12.2017
//@ЕстьТекущаяДата(Парам01)
Процедура ЕстьТекущаяДата(Парам01) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	Контекст.Вставить("ТекущаяДата",Парам01);
КонецПроцедуры

&НаКлиенте
//Тогда Его возраст в месяцах будет равен 276
//@ЕгоВозрастВМесяцахБудетРавен(Парам01)
Процедура ЕгоВозрастВМесяцахБудетРавен(Парам01) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	Результат = ОбщийМодуль1.РассчитатьВозратСторудникаВМесяцах(Контекст.ДатаРождения,
	Контекст.ТекущаяДата);
	Если Результат <> Парам01 Тогда
		ВызватьИсключение "Расчет неверный!";
	КонецЕсли;
		
КонецПроцедуры
